IDEA StatiCa Open Model
ResultOfNLAPoint.X Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 X coordinates on cross-section
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double X { get; set; }
Public Property X As Double
	Get
	Set
public:
property double X {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
ResultOfNLAPoint Class
IdeaRS.OpenModel.Result Namespace